[
    {
        "headline": "Tom Cruise to star in new Mission: Impossible movie",
        "date": "2023-04-20T10:30:00Z",
        "source": "Variety",
        "body": "Tom Cruise has signed on to star in the upcoming Mission: Impossible movie, which is set to begin filming later this year. This will be Cruise's seventh time playing the iconic role of Ethan Hunt, and fans are already buzzing with excitement. The movie is being directed by Christopher McQuarrie, who also directed the previous two films in the franch"
    },
    {
        "headline": "Marvel announces new X-Men movie",
        "date": "2023-04-19T14:45:00Z",
        "source": "The Hollywood Reporter",
        "body": "Marvel Studios has officially announced a new X-Men movie, which will be a reboot of the popular franchise. The movie will introduce new actors in the roles of beloved characters like Wolverine, Professor X, and Magneto. Marvel has not yet announced a release date for the film."
    },
    {
        "headline": "Jennifer Lawrence to star in new indie drama",
        "date": "2023-04-18T09:15:00Z",
        "source": "Deadline",
        "body": "Jennifer Lawrence has signed on to star in a new indie drama called 'The Glass Hotel.' The film will be directed by Josephine Decker and is based on a novel by Emily St. John Mandel. Lawrence will play the role of a young woman whose life is turned upside down when her husband disappears from a luxury hotel."
    },
    {
        "headline": "Disney to release live-action remake of 'The Little Mermaid'",
        "date": "2023-04-17T11:00:00Z",
        "source": "Entertainment Weekly",
        "body": "Disney has announced that it will release a live-action remake of the classic animated film 'The Little Mermaid.' The movie will feature new songs by Lin-Manuel Miranda and a cast that includes Halle Bailey as Ariel, Melissa McCarthy as Ursula, and Javier Bardem as King Triton. The film is set to hit theaters in December 2023."
    },
    {
        "headline": "Chris Hemsworth to star in new action-thriller",
        "date": "2023-04-16T16:30:00Z",
        "source": "Variety",
        "body": "Chris Hemsworth has signed on to star in a new action-thriller called 'Interceptor.' The film will be directed by Matthew Reilly and follows a team of special operatives who must stop a group of terrorists from launching a nuclear attack. Hemsworth will play the leader of the team."
    },
    {
        "headline": "Zendaya to produce and star in new HBO series",
        "date": "2023-04-15T08:45:00Z",
        "source": "The Wrap",
        "body": "Zendaya is set to produce and star in a new HBO series called 'The Secret Life of Blanca Snow.' The show is described as a modern retelling of the Snow White fairy tale and will explore themes of identity, power, and family. Zendaya will play the lead role of Blanca Snow, who discovers that she has a secret twin sister."
    }
]